Revit 2024 API
FabricationPartBrowserChangedEventArgs Class
 The event arguments used by the FabricationPartBrowserChangedEventArgs event.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public class FabricationPartBrowserChangedEventArgs : RevitAPISingleEventArgs
Visual Basic
Public Class FabricationPartBrowserChangedEventArgs _
	Inherits RevitAPISingleEventArgs
Visual C++
public ref class FabricationPartBrowserChangedEventArgs : public RevitAPISingleEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs
See Also
FabricationPartBrowserChangedEventArgs Members
Autodesk.Revit.UI.Events Namespace